Revit 2027 API
BaseImportOptions.OrientToView Property
 Place the import at the same orientation as the view that was passed into the import method. This option can only be used when not importing into a single view.(i.e. ThisViewOnly is set to false)
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool OrientToView { get; set; }
Public Property OrientToView As Boolean
	Get
	Set
public:
property bool OrientToView {
	bool get ();
	void set (bool value);
}
member OrientToView : bool with get, set
Property Value
Boolean
See Also
Reference
BaseImportOptions Class
Autodesk.Revit.DB Namespace